nxp-mcuxpresso/mcux-soc-svd/MIMXRT1052/MIMXRT1052.xml
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART6_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART6_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART6_IPG_DOZE</name>
              <description>LPUART6 ipg_doze mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART6_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART6_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART7_IPG_STOP_MODE</name>
              <description>LPUART7 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART7_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART7_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART7_IPG_DOZE</name>
              <description>LPUART7 ipg_doze mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART7_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART7_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART8_IPG_STOP_MODE</name>
              <description>LPUART8 stop mode selection, cannot change when ipg_stop is asserted.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART8_IPG_STOP_MODE_0</name>
                  <description>the module is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART8_IPG_STOP_MODE_1</name>
                  <description>the module is NOT functional in Stop mode, when this bit is equal to 1 and ipg_stop is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART8_IPG_DOZE</name>
              <description>LPUART8 ipg_doze mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPUART8_IPG_DOZE_0</name>
                  <description>not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART8_IPG_DOZE_1</name>
                  <description>in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR9</name>
          <description>GPR9 General Purpose Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR10</name>
          <description>GPR10 General Purpose Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NIDEN</name>
              <description>Arm non-secure (non-invasive) debug enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NIDEN_0</name>
                  <description>Debug turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NIDEN_1</name>
                  <description>Debug enabled (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_EN</name>
              <description>Arm invasive debug enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBG_EN_0</name>
                  <description>Debug turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_EN_1</name>
                  <description>Debug enabled (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_ERR_RESP</name>
              <description>Security error response enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEC_ERR_RESP_0</name>
                  <description>OKEY response</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC_ERR_RESP_1</name>
                  <description>SLVError (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCPKEY_OCOTP_OR_KEYMUX</name>
              <description>DCP Key selection bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCPKEY_OCOTP_OR_KEYMUX_0</name>
                  <description>Select key from SNVS Master Key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCPKEY_OCOTP_OR_KEYMUX_1</name>
                  <description>Select key from OCOTP (SW_GP2)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_TZ_EN</name>
              <description>OCRAM TrustZone (TZ) enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCRAM_TZ_EN_0</name>
                  <description>The TrustZone feature is disabled. Entire OCRAM space is available for all access types (secure/non-secure/user/supervisor)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCRAM_TZ_EN_1</name>
                  <description>The TrustZone feature is enabled. Access to address in the range specified by [ENDADDR:STARTADDR] follows the execution mode access policy described in CSU chapter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_TZ_ADDR</name>
              <description>OCRAM TrustZone (TZ) start address</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_NIDEN</name>
              <description>Lock NIDEN field for changes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_NIDEN_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_NIDEN_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_DBG_EN</name>
              <description>Lock DBG_EN field for changes</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_DBG_EN_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_DBG_EN_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_SEC_ERR_RESP</name>
              <description>Lock SEC_ERR_RESP field for changes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_SEC_ERR_RESP_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_SEC_ERR_RESP_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_DCPKEY_OCOTP_OR_KEYMUX</name>
              <description>Lock DCP Key OCOTP/Key MUX selection bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_DCPKEY_OCOTP_OR_KEYMUX_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_DCPKEY_OCOTP_OR_KEYMUX_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_OCRAM_TZ_EN</name>
              <description>Lock OCRAM_TZ_EN field for changes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_OCRAM_TZ_EN_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_OCRAM_TZ_EN_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_OCRAM_TZ_ADDR</name>
              <description>Lock OCRAM_TZ_ADDR field for changes</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_OCRAM_TZ_ADDR_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_OCRAM_TZ_ADDR_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR11</name>
          <description>GPR11 General Purpose Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M7_APC_AC_R0_CTRL</name>
              <description>Access control of memory region-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_APC_AC_R0_CTRL_0</name>
                  <description>No access protection - All accesses are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_APC_AC_R0_CTRL_1</name>
                  <description>M7 debug protection enabled - The APC block will block CM7 breakpoints, watchpoints and trace to the GPR_M7_APC_AC_R0_TOP/BOT specified region (IOMUXC_GPR_GPR18 - IOMUXC_GPR_GPR19)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R1_CTRL</name>
              <description>Access control of memory region-1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_APC_AC_R1_CTRL_0</name>
                  <description>No access protection - All accesses are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_APC_AC_R1_CTRL_1</name>
                  <description>M7 debug protection enabled - The APC block will block CM7 breakpoints, watchpoints and trace to the GPR_M7_APC_AC_R1_TOP/BOT specified region (IOMUXC_GPR_GPR20 - IOMUXC_GPR_GPR21)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R2_CTRL</name>
              <description>Access control of memory region-2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_APC_AC_R2_CTRL_0</name>
                  <description>No access protection - All accesses are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_APC_AC_R2_CTRL_1</name>
                  <description>M7 debug protection enabled - The APC block will block CM7 breakpoints, watchpoints and trace to the GPR_M7_APC_AC_R2_TOP/BOT specified region (IOMUXC_GPR_GPR22 - IOMUXC_GPR_GPR23)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R3_CTRL</name>
              <description>Access control of memory region-3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_APC_AC_R3_CTRL_0</name>
                  <description>No access protection - All accesses are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_APC_AC_R3_CTRL_1</name>
                  <description>M7 debug protection enabled - The APC block will block CM7 breakpoints, watchpoints and trace to the GPR_M7_APC_AC_R3_TOP/BOT specified region (IOMUXC_GPR_GPR24 - IOMUXC_GPR_GPR25)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEE_DE_RX_EN</name>
              <description>BEE data decryption of memory region-n (n = 3 to 0).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEE_DE_RX_EN_0</name>
                  <description>FlexSPI data decryption disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEE_DE_RX_EN_1</name>
                  <description>FlexSPI data decryption enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_M7_APC_AC_R0_CTRL</name>
              <description>Lock M7_APC_AC_R0_CTRL field for changes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R0_CTRL_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R0_CTRL_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_M7_APC_AC_R1_CTRL</name>
              <description>Lock M7_APC_AC_R1_CTRL field for changes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R1_CTRL_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R1_CTRL_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_M7_APC_AC_R2_CTRL</name>
              <description>Lock M7_APC_AC_R2_CTRL field for changes</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_CTRL_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_CTRL_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_M7_APC_AC_R3_CTRL</name>
              <description>Lock M7_APC_AC_R3_CTRL field for changes</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_CTRL_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_CTRL_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_BEE_DE_RX_EN</name>
              <description>Lock BEE_DE_RX_EN[n] (n = 3 to 0) field for changes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_BEE_DE_RX_EN_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_BEE_DE_RX_EN_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
