nxp-mcuxpresso/mcux-soc-svd/MIMXRT1052/MIMXRT1052.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>CCM</name>
      <description>CCM</description>
      <groupName>CCM</groupName>
      <prependToName>CCM_</prependToName>
      <baseAddress>0x400FC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CCM_1</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>CCM_2</name>
        <value>96</value>
      </interrupt>
      <registers>
        <register>
          <name>CCR</name>
          <description>CCM Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x401107F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSCNT</name>
              <description>Oscillator ready counter value. These bits define value of 32KHz counter, that serve as counter for oscillator lock time (count to n+1 ckil's). This is used for oscillator lock time. Current estimation is ~5ms. This counter will be used in ignition sequence and in wake from stop sequence if sbyos bit was defined, to notify that on chip oscillator output is ready for the dpll_ip to use and only then the gate in dpll_ip can be opened.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COSC_EN</name>
              <description>On chip oscillator enable bit - this bit value is reflected on the output cosc_en</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COSC_EN_0</name>
                  <description>disable on chip oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COSC_EN_1</name>
                  <description>enable on chip oscillator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REG_BYPASS_COUNT</name>
              <description>Counter for analog_reg_bypass signal assertion after standby voltage request by PMIC_STBY_REQ</description>
              <bitOffset>21</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REG_BYPASS_COUNT_0</name>
                  <description>no delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG_BYPASS_COUNT_1</name>
                  <description>1 CKIL clock period delay</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG_BYPASS_COUNT_63</name>
                  <description>63 CKIL clock periods delay</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBC_EN</name>
              <description>Enable for REG_BYPASS_COUNTER</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBC_EN_0</name>
                  <description>REG_BYPASS_COUNTER disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBC_EN_1</name>
                  <description>REG_BYPASS_COUNTER enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>CCM Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_EN_B</name>
              <description>Status of the value of CCM_REF_EN_B output of ccm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REF_EN_B_0</name>
                  <description>value of CCM_REF_EN_B is '0'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REF_EN_B_1</name>
                  <description>value of CCM_REF_EN_B is '1'</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAMP2_READY</name>
              <description>Status indication of CAMP2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAMP2_READY_0</name>
                  <description>CAMP2 is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAMP2_READY_1</name>
                  <description>CAMP2 is ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COSC_READY</name>
              <description>Status indication of on board oscillator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COSC_READY_0</name>
                  <description>on board oscillator is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COSC_READY_1</name>
                  <description>on board oscillator is ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSR</name>
          <description>CCM Clock Switcher Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL3_SW_CLK_SEL</name>
              <description>Selects source to generate pll3_sw_clk. This bit should only be used for testing purposes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLL3_SW_CLK_SEL_0</name>
                  <description>pll3_main_clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_SW_CLK_SEL_1</name>
                  <description>pll3 bypass clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CACRR</name>
          <description>CCM Arm Clock Root Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARM_PODF</name>
              <description>Divider for Arm clock root</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CBCDR</name>
          <description>CCM Bus Clock Divider Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA8300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEMC_CLK_SEL</name>
              <description>SEMC clock source select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEMC_CLK_SEL_0</name>
                  <description>Periph_clk output will be used as SEMC clock root</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_CLK_SEL_1</name>
                  <description>SEMC alternative clock will be used as SEMC clock root</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMC_ALT_CLK_SEL</name>
              <description>SEMC alternative clock select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEMC_ALT_CLK_SEL_0</name>
                  <description>PLL2 PFD2 will be selected as alternative clock for SEMC root clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_ALT_CLK_SEL_1</name>
                  <description>PLL3 PFD1 will be selected as alternative clock for SEMC root clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPG_PODF</name>
              <description>Divider for ipg podf.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPG_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPG_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_PODF</name>
              <description>Divider for AHB PODF</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMC_PODF</name>
              <description>Post divider for SEMC clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEMC_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_CLK_SEL</name>
              <description>Selector for peripheral main clock</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_0</name>
                  <description>derive clock from pre_periph_clk_sel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_1</name>
                  <description>derive clock from periph_clk2_clk_divided</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_CLK2_PODF</name>
              <description>Divider for periph_clk2_podf.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK2_PODF_0</name>
                  <description>divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_PODF_1</name>
                  <description>divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_PODF_2</name>
                  <description>divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_PODF_3</name>
                  <description>divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_PODF_4</name>
                  <description>divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_PODF_5</name>
                  <description>divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_PODF_6</name>
                  <description>divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK2_PODF_7</name>
                  <description>divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
