nxp-mcuxpresso/mcux-soc-svd/MIMXRT1052/MIMXRT1052.xml
        <register>
          <name>GFWR</name>
          <description>Glitch Filter Width Registers</description>
          <addressOffset>0x9E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GFWR</name>
              <description>It determines the Glitch Filter Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="CAN1">
      <name>CAN2</name>
      <description>FLEXCAN</description>
      <groupName>CAN</groupName>
      <prependToName>FLEXCAN2_</prependToName>
      <baseAddress>0x401D4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x9E4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CAN2</name>
        <value>37</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TMR1</name>
      <description>Quad Timer</description>
      <groupName>TMR</groupName>
      <prependToName>TMR1_</prependToName>
      <headerStructName>TMR</headerStructName>
      <baseAddress>0x401DC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7A</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMR1</name>
        <value>133</value>
      </interrupt>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>COMP1%s</name>
          <description>Timer Channel Compare Register 1</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COMPARISON_1</name>
              <description>Comparison Value 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>COMP2%s</name>
          <description>Timer Channel Compare Register 2</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COMPARISON_2</name>
              <description>Comparison Value 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CAPT%s</name>
          <description>Timer Channel Capture Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CAPTURE</name>
              <description>Capture Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>LOAD%s</name>
          <description>Timer Channel Load Register</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Timer Load Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>HOLD%s</name>
          <description>Timer Channel Hold Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>HOLD</name>
              <description>This read/write register stores the counter's values of specific channels whenever any of the four counters within a module is read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CNTR%s</name>
          <description>Timer Channel Counter Register</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>COUNTER</name>
              <description>This read/write register is the counter for the corresponding channel in a timer module.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CTRL%s</name>
          <description>Timer Channel Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OUTMODE</name>
              <description>Output Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMODE_0</name>
                  <description>Asserted while counter is active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMODE_1</name>
                  <description>Clear OFLAG output on successful compare</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMODE_2</name>
                  <description>Set OFLAG output on successful compare</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMODE_3</name>
                  <description>Toggle OFLAG output on successful compare</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMODE_4</name>
                  <description>Toggle OFLAG output using alternating compare registers</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMODE_5</name>
                  <description>Set on compare, cleared on secondary source input edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMODE_6</name>
                  <description>Set on compare, cleared on counter rollover</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMODE_7</name>
                  <description>Enable gated clock output while counter is active</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COINIT</name>
              <description>Co-Channel Initialization</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COINIT_0</name>
                  <description>Co-channel counter/timers cannot force a re-initialization of this counter/timer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COINIT_1</name>
                  <description>Co-channel counter/timers may force a re-initialization of this counter/timer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Count Direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIR_0</name>
                  <description>Count up.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIR_1</name>
                  <description>Count down.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LENGTH</name>
              <description>Count Length</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LENGTH_0</name>
                  <description>Count until roll over at $FFFF and continue from $0000.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LENGTH_1</name>
                  <description>Count until compare, then re-initialize. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, alternating values of COMP1 and COMP2 are used to generate successful comparisons. For example, the counter counts until a COMP1 value is reached, re-initializes, counts until COMP2 value is reached, re-initializes, counts until COMP1 value is reached, and so on.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONCE</name>
              <description>Count Once</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONCE_0</name>
                  <description>Count repeatedly.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONCE_1</name>
                  <description>Count until compare and then stop. If counting up, a successful compare occurs when the counter reaches a COMP1 value. If counting down, a successful compare occurs when the counter reaches a COMP2 value. When output mode $4 is used, the counter re-initializes after reaching the COMP1 value, continues to count to the COMP2 value, and then stops.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>Secondary Count Source</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCS_0</name>
                  <description>Counter 0 input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCS_1</name>
                  <description>Counter 1 input pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCS_2</name>
                  <description>Counter 2 input pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCS_3</name>
                  <description>Counter 3 input pin</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCS</name>
              <description>Primary Count Source</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCS_0</name>
                  <description>Counter 0 input pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_1</name>
                  <description>Counter 1 input pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_2</name>
                  <description>Counter 2 input pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_3</name>
                  <description>Counter 3 input pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_4</name>
                  <description>Counter 0 output</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_5</name>
                  <description>Counter 1 output</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_6</name>
                  <description>Counter 2 output</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_7</name>
                  <description>Counter 3 output</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_8</name>
                  <description>IP bus clock divide by 1 prescaler</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_9</name>
                  <description>IP bus clock divide by 2 prescaler</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_10</name>
                  <description>IP bus clock divide by 4 prescaler</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_11</name>
                  <description>IP bus clock divide by 8 prescaler</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_12</name>
                  <description>IP bus clock divide by 16 prescaler</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_13</name>
                  <description>IP bus clock divide by 32 prescaler</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_14</name>
                  <description>IP bus clock divide by 64 prescaler</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCS_15</name>
                  <description>IP bus clock divide by 128 prescaler</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Count Mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <description>Count rising edges of primary sourceRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1. If the primary count source is IP bus clock divide by 1, only rising edges are counted regardless of the value of SCTRL[IPS].</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <description>Count rising and falling edges of primary sourceIP bus clock divide by 1 cannot be used as a primary count source in edge count mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <description>Count rising edges of primary source while secondary input high active</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_4</name>
                  <description>Quadrature count mode, uses primary and secondary sources</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_5</name>
                  <description>Count rising edges of primary source; secondary source specifies directionRising edges are counted only when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_6</name>
                  <description>Edge of secondary source triggers primary count until compare</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_7</name>
                  <description>Cascaded counter mode (up/down)The primary count source must be set to one of the counter outputs.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
