nxp-mcuxpresso/mcux-soc-svd/MIMXRT1052/MIMXRT1052.xml
        <register>
          <name>AS_CTRL</name>
          <description>Alpha Surface Control</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALPHA_CTRL</name>
              <description>Determines how the alpha value is constructed for this alpha surface</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Embedded</name>
                  <description>Indicates that the AS pixel alpha value will be used to blend the AS with PS. The ALPHA field is ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Override</name>
                  <description>Indicates that the value in the ALPHA field should be used instead of the alpha values present in the input pixels.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Multiply</name>
                  <description>Indicates that the value in the ALPHA field should be used to scale all pixel alpha values. Each pixel alpha is multiplied by the value in the ALPHA field.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROPs</name>
                  <description>Enable ROPs. The ROP field indicates an operation to be performed on the alpha surface and PS pixels.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_COLORKEY</name>
              <description>Indicates that colorkey functionality is enabled for this alpha surface</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORMAT</name>
              <description>Indicates the input buffer format for AS.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARGB8888</name>
                  <description>32-bit pixels with alpha</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA888</name>
                  <description>2-bit pixel with alpha at low 8 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888</name>
                  <description>32-bit pixels without alpha (unpacked 24-bit format)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB1555</name>
                  <description>16-bit pixels with alpha</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB4444</name>
                  <description>16-bit pixels with alpha</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA5551</name>
                  <description>16-bit pixel with alpha at low 1 bit</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGBA4444</name>
                  <description>16-bit pixel with alpha at low 4 bits</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB555</name>
                  <description>16-bit pixels without alpha</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB444</name>
                  <description>16-bit pixels without alpha</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>16-bit pixels without alpha</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha modifier used when the ALPHA_MULTIPLY or ALPHA_OVERRIDE values are programmed in PXP_AS_CTRL[ALPHA_CTRL]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROP</name>
              <description>Indicates a raster operation to perform when enabled</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASKAS</name>
                  <description>AS AND PS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKNOTAS</name>
                  <description>nAS AND PS</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASKASNOT</name>
                  <description>AS AND nPS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MERGEAS</name>
                  <description>AS OR PS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MERGENOTAS</name>
                  <description>nAS OR PS</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MERGEASNOT</name>
                  <description>AS OR nPS</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTCOPYAS</name>
                  <description>nAS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT</name>
                  <description>nPS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTMASKAS</name>
                  <description>AS NAND PS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTMERGEAS</name>
                  <description>AS NOR PS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XORAS</name>
                  <description>AS XOR PS</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTXORAS</name>
                  <description>AS XNOR PS</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALPHA_INVERT</name>
              <description>Setting this bit to logic 0 will not alter the alpha value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALPHA_INVERT_0</name>
                  <description>Not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inverted</name>
                  <description>Inverted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AS_BUF</name>
          <description>Alpha Surface Buffer Pointer</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address pointer for the alpha surface 0 buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AS_PITCH</name>
          <description>Alpha Surface Pitch</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Indicates the number of bytes in memory between two vertically adjacent pixels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AS_CLRKEYLOW</name>
          <description>Overlay Color Key Low</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL</name>
              <description>Low range of RGB color key applied to AS buffer. Each overlay has an independent colorkey enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AS_CLRKEYHIGH</name>
          <description>Overlay Color Key High</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL</name>
              <description>High range of RGB color key applied to AS buffer. Each overlay has an independent colorkey enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSC1_COEF0</name>
          <description>Color Space Conversion Coefficient Register 0</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y_OFFSET</name>
              <description>Two's compliment amplitude offset implicit in the Y data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UV_OFFSET</name>
              <description>Two's compliment phase offset implicit for CbCr data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C0</name>
              <description>Two's compliment Y multiplier coefficient. YUV=0x100 (1.000) YCbCr=0x12A (1.164)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass the CSC unit in the scaling engine</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YCBCR_MODE</name>
              <description>Set to 1 when performing YCbCr conversion to RGB</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YCBCR_MODE_0</name>
                  <description>YUV to RGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YCBCR_MODE_1</name>
                  <description>YCbCr to RGB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSC1_COEF1</name>
          <description>Color Space Conversion Coefficient Register 1</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1230208</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C4</name>
              <description>Two's compliment Blue U/Cb multiplier coefficient. YUV=0x208 (2.032) YCbCr=0x204 (2.017)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C1</name>
              <description>Two's compliment Red V/Cr multiplier coefficient. YUV=0x123 (1.140) YCbCr=0x198 (1.596)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSC1_COEF2</name>
          <description>Color Space Conversion Coefficient Register 2</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x79B076C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C3</name>
              <description>Two's complement Green U/Cb multiplier coefficient. YUV=0x79C (-0.394) YCbCr=0x79C (-0.392)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C2</name>
              <description>Two's complement Green V/Cr multiplier coefficient. YUV=0x76B (-0.581) YCbCr=0x730 (-0.813)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>PXP Power Control Register</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ROT_MEM_LP_STATE</name>
              <description>Select the low power state of the Rotation (ROT) memory.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Memory is not in low power state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Light Sleep Mode. Low leakage mode, maintain memory contents.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DS</name>
                  <description>Deep Sleep Mode. Low leakage mode, maintain memory contents.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SD</name>
                  <description>Shut Down Mode. Shut Down periphery and core, no memory retention.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRL</name>
              <description>Power control for the PXP.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NEXT</name>
          <description>Next Frame Pointer</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>Indicates that the &quot;next frame&quot; functionality has been enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POINTER</name>
              <description>A pointer to a data structure containing register values to be used when processing the next frame</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
