nxp-mcuxpresso/mcux-soc-svd/MIMXRT1052/MIMXRT1052.xml
        <register>
          <name>PORTER_DUFF_CTRL</name>
          <description>PXP Alpha Engine A Control Register.</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PORTER_DUFF_ENABLE</name>
              <description>Porter-Duff Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0_S1_FACTOR_MODE</name>
              <description>s0 to s1 factor mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0_S1_FACTOR_MODE_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0_S1_FACTOR_MODE_1</name>
                  <description>0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0_S1_FACTOR_MODE_2</name>
                  <description>Straight alpha</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0_S1_FACTOR_MODE_3</name>
                  <description>Inverse alpha</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0_GLOBAL_ALPHA_MODE</name>
              <description>s0 global alpha mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0_GLOBAL_ALPHA_MODE_0</name>
                  <description>Global alpha</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0_GLOBAL_ALPHA_MODE_1</name>
                  <description>Local alpha</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0_GLOBAL_ALPHA_MODE_2</name>
                  <description>Scaled alpha</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0_GLOBAL_ALPHA_MODE_3</name>
                  <description>Scaled alpha</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0_ALPHA_MODE</name>
              <description>s0 alpha mode (Porter-Duff alpha mode)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0_ALPHA_MODE_0</name>
                  <description>Straight mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0_ALPHA_MODE_1</name>
                  <description>Inverted mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0_COLOR_MODE</name>
              <description>s0 color mode (Porter-Duff color mode)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0_COLOR_MODE_0</name>
                  <description>Original pixel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S0_COLOR_MODE_1</name>
                  <description>Scaled pixel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S1_S0_FACTOR_MODE</name>
              <description>s1 to s0 factor mode (Porter-Duff factor mode)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S1_S0_FACTOR_MODE_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1_S0_FACTOR_MODE_1</name>
                  <description>0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1_S0_FACTOR_MODE_2</name>
                  <description>Straight alpha</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1_S0_FACTOR_MODE_3</name>
                  <description>Inverse alpha</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S1_GLOBAL_ALPHA_MODE</name>
              <description>s1 global alpha mode (Porter-Duff Global Alpha mode)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S1_GLOBAL_ALPHA_MODE_0</name>
                  <description>Global alpha</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1_GLOBAL_ALPHA_MODE_1</name>
                  <description>Local alpha</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1_GLOBAL_ALPHA_MODE_2</name>
                  <description>Scaled alpha</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1_GLOBAL_ALPHA_MODE_3</name>
                  <description>Scaled alpha</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S1_ALPHA_MODE</name>
              <description>s1 alpha mode (Porter-Duff Alpha mode)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S1_ALPHA_MODE_0</name>
                  <description>Straight mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1_ALPHA_MODE_1</name>
                  <description>Inverted mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S1_COLOR_MODE</name>
              <description>s1 color mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S1_COLOR_MODE_0</name>
                  <description>Original pixel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S1_COLOR_MODE_1</name>
                  <description>Scaled pixel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0_GLOBAL_ALPHA</name>
              <description>s0 global alpha</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S1_GLOBAL_ALPHA</name>
              <description>s1 global alpha</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
