nxp-mcuxpresso/mcux-soc-svd/MIMXRT1052/MIMXRT1052.xml
        <register>
          <name>CTRL2_SET</name>
          <description>LCDIF General Control2 Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVEN_LINE_PATTERN</name>
              <description>This field determines the order of the RGB components of each pixel in EVEN lines (line numbers 2,4,6,</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB</name>
                  <description>RGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBG</name>
                  <description>RBG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GBR</name>
                  <description>GBR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRB</name>
                  <description>GRB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRG</name>
                  <description>BRG</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR</name>
                  <description>BGR</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODD_LINE_PATTERN</name>
              <description>This field determines the order of the RGB components of each pixel in ODD lines (line numbers 1,3,5,</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB</name>
                  <description>RGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBG</name>
                  <description>RBG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GBR</name>
                  <description>GBR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRB</name>
                  <description>GRB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRG</name>
                  <description>BRG</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR</name>
                  <description>BGR</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURST_LEN_8</name>
              <description>By default, when the LCDIF is in the bus master mode, it will issue AXI bursts of length 16 (except when in packed 24 bpp mode, it will issue bursts of length 15)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSTANDING_REQS</name>
              <description>This bitfield indicates the maximum number of outstanding transactions that LCDIF should request when it is acting as a bus master</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ_1</name>
                  <description>REQ_1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_2</name>
                  <description>REQ_2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_4</name>
                  <description>REQ_4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_8</name>
                  <description>REQ_8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_16</name>
                  <description>REQ_16</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2_CLR</name>
          <description>LCDIF General Control2 Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVEN_LINE_PATTERN</name>
              <description>This field determines the order of the RGB components of each pixel in EVEN lines (line numbers 2,4,6,</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB</name>
                  <description>RGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBG</name>
                  <description>RBG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GBR</name>
                  <description>GBR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRB</name>
                  <description>GRB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRG</name>
                  <description>BRG</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR</name>
                  <description>BGR</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODD_LINE_PATTERN</name>
              <description>This field determines the order of the RGB components of each pixel in ODD lines (line numbers 1,3,5,</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB</name>
                  <description>RGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBG</name>
                  <description>RBG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GBR</name>
                  <description>GBR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRB</name>
                  <description>GRB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRG</name>
                  <description>BRG</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR</name>
                  <description>BGR</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURST_LEN_8</name>
              <description>By default, when the LCDIF is in the bus master mode, it will issue AXI bursts of length 16 (except when in packed 24 bpp mode, it will issue bursts of length 15)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSTANDING_REQS</name>
              <description>This bitfield indicates the maximum number of outstanding transactions that LCDIF should request when it is acting as a bus master</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ_1</name>
                  <description>REQ_1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_2</name>
                  <description>REQ_2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_4</name>
                  <description>REQ_4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_8</name>
                  <description>REQ_8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_16</name>
                  <description>REQ_16</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2_TOG</name>
          <description>LCDIF General Control2 Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVEN_LINE_PATTERN</name>
              <description>This field determines the order of the RGB components of each pixel in EVEN lines (line numbers 2,4,6,</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB</name>
                  <description>RGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBG</name>
                  <description>RBG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GBR</name>
                  <description>GBR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRB</name>
                  <description>GRB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRG</name>
                  <description>BRG</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR</name>
                  <description>BGR</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODD_LINE_PATTERN</name>
              <description>This field determines the order of the RGB components of each pixel in ODD lines (line numbers 1,3,5,</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB</name>
                  <description>RGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBG</name>
                  <description>RBG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GBR</name>
                  <description>GBR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRB</name>
                  <description>GRB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRG</name>
                  <description>BRG</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR</name>
                  <description>BGR</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURST_LEN_8</name>
              <description>By default, when the LCDIF is in the bus master mode, it will issue AXI bursts of length 16 (except when in packed 24 bpp mode, it will issue bursts of length 15)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSTANDING_REQS</name>
              <description>This bitfield indicates the maximum number of outstanding transactions that LCDIF should request when it is acting as a bus master</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ_1</name>
                  <description>REQ_1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_2</name>
                  <description>REQ_2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_4</name>
                  <description>REQ_4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_8</name>
                  <description>REQ_8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_16</name>
                  <description>REQ_16</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRANSFER_COUNT</name>
          <description>LCDIF Horizontal and Vertical Valid Data Count Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>H_COUNT</name>
              <description>Total valid data (pixels) in each horizontal line</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>V_COUNT</name>
              <description>Number of horizontal lines per frame which contain valid data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CUR_BUF</name>
          <description>LCD Interface Current Buffer Address Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address of the current frame being transmitted by LCDIF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NEXT_BUF</name>
          <description>LCD Interface Next Buffer Address Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address of the next frame that will be transmitted by LCDIF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCTRL0</name>
          <description>LCDIF VSYNC Mode and Dotclk Mode Control Register0</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSYNC_PULSE_WIDTH</name>
              <description>Number of units for which VSYNC signal is active</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALF_LINE_MODE</name>
              <description>When this bit is 0, the first field (VSYNC period) will end in half a horizontal line and the second field will begin with half a horizontal line</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALF_LINE</name>
              <description>Setting this bit to 1 will make the total VSYNC period equal to the VSYNC_PERIOD field plus half the HORIZONTAL_PERIOD field (i</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNC_PULSE_WIDTH_UNIT</name>
              <description>Default 0 for counting VSYNC_PULSE_WIDTH in terms of DISPLAY CLOCK (pix_clk) cycles</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNC_PERIOD_UNIT</name>
              <description>Default 0 for counting VSYNC_PERIOD in terms of DISPLAY CLOCK (pix_clk) cycles</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_POL</name>
              <description>Default 0 active low during valid data transfer on each horizontal line.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOTCLK_POL</name>
              <description>Default is data launched at negative edge of DOTCLK and captured at positive edge</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSYNC_POL</name>
              <description>Default 0 active low during HSYNC_PULSE_WIDTH time and will be high during the rest of the HSYNC period</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNC_POL</name>
              <description>Default 0 active low during VSYNC_PULSE_WIDTH time and will be high during the rest of the VSYNC period</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_PRESENT</name>
              <description>Setting this bit to 1 will make the hardware generate the ENABLE signal in the DOTCLK mode, thereby making it the true RGB interface along with the remaining three signals VSYNC, HSYNC and DOTCLK</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
