nxp-mcuxpresso/mcux-soc-svd/MIMXRT1052/MIMXRT1052.xml
        <register>
          <name>RGB_ADJUST_SET</name>
          <description>RGB Color Range Adjust</description>
          <addressOffset>0x2A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL</name>
              <description>Adjust value of RGB color for display.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGB_ADJ_MODE</name>
              <description>When this bit is set by software, the LCDIF work as sync mode with CSI input.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ADJ</name>
                  <description>No Adjust</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC_MODE</name>
                  <description>Increment RGB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEC_MODE</name>
                  <description>Decrement RGB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUT_MODE</name>
                  <description>Multiply RGB</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RGB_ADJUST_CLR</name>
          <description>RGB Color Range Adjust</description>
          <addressOffset>0x2A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL</name>
              <description>Adjust value of RGB color for display.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGB_ADJ_MODE</name>
              <description>When this bit is set by software, the LCDIF work as sync mode with CSI input.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ADJ</name>
                  <description>No Adjust</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC_MODE</name>
                  <description>Increment RGB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEC_MODE</name>
                  <description>Decrement RGB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUT_MODE</name>
                  <description>Multiply RGB</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RGB_ADJUST_TOG</name>
          <description>RGB Color Range Adjust</description>
          <addressOffset>0x2AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL</name>
              <description>Adjust value of RGB color for display.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGB_ADJ_MODE</name>
              <description>When this bit is set by software, the LCDIF work as sync mode with CSI input.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ADJ</name>
                  <description>No Adjust</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC_MODE</name>
                  <description>Increment RGB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEC_MODE</name>
                  <description>Decrement RGB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUT_MODE</name>
                  <description>Multiply RGB</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL0</name>
          <description>LCDIF Pigeon Mode Control0 Register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FD_PERIOD</name>
              <description>Period of line counter during FD phase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LD_PERIOD</name>
              <description>Period of pclk counter during LD phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL0_SET</name>
          <description>LCDIF Pigeon Mode Control0 Register</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FD_PERIOD</name>
              <description>Period of line counter during FD phase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LD_PERIOD</name>
              <description>Period of pclk counter during LD phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL0_CLR</name>
          <description>LCDIF Pigeon Mode Control0 Register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FD_PERIOD</name>
              <description>Period of line counter during FD phase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LD_PERIOD</name>
              <description>Period of pclk counter during LD phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL0_TOG</name>
          <description>LCDIF Pigeon Mode Control0 Register</description>
          <addressOffset>0x38C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FD_PERIOD</name>
              <description>Period of line counter during FD phase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LD_PERIOD</name>
              <description>Period of pclk counter during LD phase</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL1</name>
          <description>LCDIF Pigeon Mode Control1 Register</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME_CNT_PERIOD</name>
              <description>Period of frame counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_CNT_CYCLES</name>
              <description>Max cycles of frame counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL1_SET</name>
          <description>LCDIF Pigeon Mode Control1 Register</description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME_CNT_PERIOD</name>
              <description>Period of frame counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_CNT_CYCLES</name>
              <description>Max cycles of frame counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL1_CLR</name>
          <description>LCDIF Pigeon Mode Control1 Register</description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME_CNT_PERIOD</name>
              <description>Period of frame counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_CNT_CYCLES</name>
              <description>Max cycles of frame counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL1_TOG</name>
          <description>LCDIF Pigeon Mode Control1 Register</description>
          <addressOffset>0x39C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME_CNT_PERIOD</name>
              <description>Period of frame counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_CNT_CYCLES</name>
              <description>Max cycles of frame counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL2</name>
          <description>LCDIF Pigeon Mode Control2 Register</description>
          <addressOffset>0x3A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIGEON_DATA_EN</name>
              <description>Pigeon mode data enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIGEON_CLK_GATE</name>
              <description>Pigeon mode dot clock gate enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL2_SET</name>
          <description>LCDIF Pigeon Mode Control2 Register</description>
          <addressOffset>0x3A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIGEON_DATA_EN</name>
              <description>Pigeon mode data enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIGEON_CLK_GATE</name>
              <description>Pigeon mode dot clock gate enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL2_CLR</name>
          <description>LCDIF Pigeon Mode Control2 Register</description>
          <addressOffset>0x3A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIGEON_DATA_EN</name>
              <description>Pigeon mode data enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIGEON_CLK_GATE</name>
              <description>Pigeon mode dot clock gate enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIGEONCTRL2_TOG</name>
          <description>LCDIF Pigeon Mode Control2 Register</description>
          <addressOffset>0x3AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIGEON_DATA_EN</name>
              <description>Pigeon mode data enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIGEON_CLK_GATE</name>
              <description>Pigeon mode dot clock gate enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
