nxp-mcuxpresso/mcux-soc-svd/MIMXRT1052/MIMXRT1052.xml
        <register>
          <name>CR3</name>
          <description>CSI Control Register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ECC_AUTO_EN</name>
              <description>Automatic Error Correction Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECC_AUTO_EN_0</name>
                  <description>Auto Error correction is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECC_AUTO_EN_1</name>
                  <description>Auto Error correction is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECC_INT_EN</name>
              <description>Error Detection Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECC_INT_EN_0</name>
                  <description>No interrupt is generated when error is detected. Only the status bit ECC_INT is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECC_INT_EN_1</name>
                  <description>Interrupt is generated when error is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZERO_PACK_EN</name>
              <description>Dummy Zero Packing Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO_PACK_EN_0</name>
                  <description>Zero packing disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO_PACK_EN_1</name>
                  <description>Zero packing enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSOR_16BITS</name>
              <description>16-bit Sensor Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENSOR_16BITS_0</name>
                  <description>Only one 8-bit sensor is connected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENSOR_16BITS_1</name>
                  <description>One 16-bit sensor is connected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFF_LEVEL</name>
              <description>RxFIFO Full Level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RxFF_LEVEL_0</name>
                  <description>4 Double words</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_1</name>
                  <description>8 Double words</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_2</name>
                  <description>16 Double words</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_3</name>
                  <description>24 Double words</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_4</name>
                  <description>32 Double words</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_5</name>
                  <description>48 Double words</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_6</name>
                  <description>64 Double words</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_LEVEL_7</name>
                  <description>96 Double words</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRESP_ERR_EN</name>
              <description>Hresponse Error Enable. This bit enables the hresponse (AHB protocol standard) error interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRESP_ERR_EN_0</name>
                  <description>Disable hresponse error interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRESP_ERR_EN_1</name>
                  <description>Enable hresponse error interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATFF_LEVEL</name>
              <description>STATFIFO Full Level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFF_LEVEL_0</name>
                  <description>4 Double words</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_1</name>
                  <description>8 Double words</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_2</name>
                  <description>12 Double words</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_3</name>
                  <description>16 Double words</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_4</name>
                  <description>24 Double words</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_5</name>
                  <description>32 Double words</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_6</name>
                  <description>48 Double words</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_LEVEL_7</name>
                  <description>64 Double words</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_REQ_EN_SFF</name>
              <description>DMA Request Enable for STATFIFO</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_REQ_EN_SFF_0</name>
                  <description>Disable the dma request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ_EN_SFF_1</name>
                  <description>Enable the dma request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_REQ_EN_RFF</name>
              <description>DMA Request Enable for RxFIFO</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_REQ_EN_RFF_0</name>
                  <description>Disable the dma request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REQ_EN_RFF_1</name>
                  <description>Enable the dma request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_REFLASH_SFF</name>
              <description>Reflash DMA Controller for STATFIFO</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_REFLASH_SFF_0</name>
                  <description>No reflashing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REFLASH_SFF_1</name>
                  <description>Reflash the embedded DMA controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_REFLASH_RFF</name>
              <description>Reflash DMA Controller for RxFIFO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_REFLASH_RFF_0</name>
                  <description>No reflashing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_REFLASH_RFF_1</name>
                  <description>Reflash the embedded DMA controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMCNT_RST</name>
              <description>Frame Count Reset. Resets the Frame Counter. (Cleared automatically after reset is done)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRMCNT_RST_0</name>
                  <description>Do not reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRMCNT_RST_1</name>
                  <description>Reset frame counter immediately</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMCNT</name>
              <description>Frame Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATFIFO</name>
          <description>CSI Statistic FIFO Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STAT</name>
              <description>Static data from sensor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIFO</name>
          <description>CSI RX FIFO Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMAGE</name>
              <description>Received image data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCNT</name>
          <description>CSI RX Count Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x9600</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXCNT</name>
              <description>RxFIFO Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
