nxp-mcuxpresso/mcux-soc-svd/MIMXRT1052/MIMXRT1052.xml
        <register>
          <name>CM7_ABFSR</name>
          <description>Auxiliary Bus Fault Status Register</description>
          <addressOffset>0xFA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM</name>
              <description>Asynchronous fault on ITCM interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCM</name>
              <description>Asynchronous fault on DTCM interface.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBP</name>
              <description>Asynchronous fault on AHBP interface.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIM</name>
              <description>Asynchronous fault on AXIM interface.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPPB</name>
              <description>Asynchronous fault on EPPB interface.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIMTYPE</name>
              <description>Indicates the type of fault on the AXIM interface. Only valid when AXIM is 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXIMTYPE_0</name>
                  <description>OKAY.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIMTYPE_1</name>
                  <description>EXOKAY.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIMTYPE_2</name>
                  <description>SLVERR.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIMTYPE_3</name>
                  <description>DECERR.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0_DMA16</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>DMA1_DMA17</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>DMA2_DMA18</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA3_DMA19</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA4_DMA20</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA5_DMA21</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>DMA6_DMA22</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>DMA7_DMA23</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>DMA8_DMA24</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>DMA9_DMA25</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA10_DMA26</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>DMA11_DMA27</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA12_DMA28</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA13_DMA29</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA14_DMA30</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA15_DMA31</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA_ERROR</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>CTI0_ERROR</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>CTI1_ERROR</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>CORE</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>LPUART1</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>LPUART2</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>LPUART3</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>LPUART4</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>LPUART5</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>LPUART6</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>LPUART7</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>LPUART8</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>LPI2C1</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>LPI2C2</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>LPI2C3</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>LPI2C4</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>LPSPI1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>LPSPI2</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>LPSPI3</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>LPSPI4</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>CAN1</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>CAN2</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>FLEXRAM</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>KPP</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>TSC_DIG</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>GPR_IRQ</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>LCDIF</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>CSI</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>PXP</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>WDOG2</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>SNVS_HP_WRAPPER</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>SNVS_HP_WRAPPER_TZ</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>SNVS_LP_WRAPPER</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>CSU</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>DCP</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>DCP_VMI</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>Reserved68</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>TRNG</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>SJC</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>BEE</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>SAI1</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>SAI2</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>SAI3_RX</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>SAI3_TX</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>SPDIF</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>PMU_EVENT</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>Reserved78</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>TEMP_LOW_HIGH</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>TEMP_PANIC</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>USB_PHY1</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>USB_PHY2</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>ADC1</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>ADC2</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>DCDC</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>Reserved86</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>Reserved87</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT0</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT1</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT2</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT3</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT4</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT5</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT6</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT7</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_Combined_0_15</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_Combined_16_31</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_Combined_0_15</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_Combined_16_31</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>GPIO3_Combined_0_15</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>GPIO3_Combined_16_31</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>GPIO4_Combined_0_15</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>GPIO4_Combined_16_31</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>GPIO5_Combined_0_15</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>GPIO5_Combined_16_31</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO1</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO2</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>WDOG1</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>RTWDOG</name>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>EWM</name>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>CCM_1</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>CCM_2</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>GPC</name>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>SRC</name>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>Reserved115</name>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>GPT1</name>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>GPT2</name>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>PWM1_0</name>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>PWM1_1</name>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>PWM1_2</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>PWM1_3</name>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>PWM1_FAULT</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>Reserved123</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>SEMC</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>USDHC1</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>USDHC2</name>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>USB_OTG2</name>
        <value>112</value>
      </interrupt>
      <interrupt>
        <name>USB_OTG1</name>
        <value>113</value>
      </interrupt>
      <interrupt>
        <name>ENET</name>
        <value>114</value>
      </interrupt>
      <interrupt>
        <name>ENET_1588_Timer</name>
        <value>115</value>
      </interrupt>
      <interrupt>
        <name>XBAR1_IRQ_0_1</name>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>XBAR1_IRQ_2_3</name>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ0</name>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ1</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ2</name>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_ERROR_IRQ</name>
        <value>121</value>
      </interrupt>
      <interrupt>
        <name>PIT</name>
        <value>122</value>
      </interrupt>
      <interrupt>
        <name>ACMP1</name>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>ACMP2</name>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>ACMP3</name>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>ACMP4</name>
        <value>126</value>
      </interrupt>
      <interrupt>
        <name>Reserved143</name>
        <value>127</value>
      </interrupt>
      <interrupt>
        <name>Reserved144</name>
        <value>128</value>
      </interrupt>
      <interrupt>
        <name>ENC1</name>
        <value>129</value>
      </interrupt>
      <interrupt>
        <name>ENC2</name>
        <value>130</value>
      </interrupt>
      <interrupt>
        <name>ENC3</name>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>ENC4</name>
        <value>132</value>
      </interrupt>
      <interrupt>
        <name>TMR1</name>
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>TMR2</name>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>TMR3</name>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>TMR4</name>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>PWM2_0</name>
        <value>137</value>
      </interrupt>
      <interrupt>
        <name>PWM2_1</name>
        <value>138</value>
      </interrupt>
      <interrupt>
        <name>PWM2_2</name>
        <value>139</value>
      </interrupt>
      <interrupt>
        <name>PWM2_3</name>
        <value>140</value>
      </interrupt>
      <interrupt>
        <name>PWM2_FAULT</name>
        <value>141</value>
      </interrupt>
      <interrupt>
        <name>PWM3_0</name>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>PWM3_1</name>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>PWM3_2</name>
        <value>144</value>
      </interrupt>
      <interrupt>
        <name>PWM3_3</name>
        <value>145</value>
      </interrupt>
      <interrupt>
        <name>PWM3_FAULT</name>
        <value>146</value>
      </interrupt>
      <interrupt>
        <name>PWM4_0</name>
        <value>147</value>
      </interrupt>
      <interrupt>
        <name>PWM4_1</name>
        <value>148</value>
      </interrupt>
      <interrupt>
        <name>PWM4_2</name>
        <value>149</value>
      </interrupt>
      <interrupt>
        <name>PWM4_3</name>
        <value>150</value>
      </interrupt>
      <interrupt>
        <name>PWM4_FAULT</name>
        <value>151</value>
      </interrupt>
      <registers>
        <register>
          <name>NVICISER0</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER1</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER2</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER3</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER4</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER0</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER1</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER2</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
